# ==========================================
# ФАЙЛ КОНФИГУРАЦИИ МОДЕЛИ
# ==========================================
# Здесь хранятся ВСЕ параметры модели и обучения.
# Это удобно потому что:
# 1) можно масштабировать модель
# 2) train.py и chat.py используют один источник настроек
# ==========================================

class Config:

    # ======================================
    # БАЗОВЫЕ ПАРАМЕТРЫ АРХИТЕКТУРЫ GPT
    # ======================================

    block_size = 128       # максимальный контекст модели
    vocab_size = 2000      # размер словаря токенов

    n_embd = 384           # размер embedding вектора
    n_head = 6             # количество attention голов
    n_layer = 6            # количество transformer блоков

    # ======================================
    # ПАРАМЕТРЫ ОБУЧЕНИЯ
    # ======================================

    batch_size = 64
    learning_rate = 3e-4
    max_steps = 20000

    # ======================================
    # УСКОРЕНИЕ ОБУЧЕНИЯ (надстройки)
    # ======================================

    use_compile = True     # torch.compile
    use_mixed_precision = True  # FP16 обучение